In [1]:
import pandas as pd

显示当前版本信息

In [2]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit: None
python: 3.7.0.final.0
python-bits: 64
OS: Windows
OS-release: 10
machine: AMD64
processor: AMD64 Family 25 Model 68 Stepping 1, AuthenticAMD
byteorder: little
LC_ALL: None
LANG: None
LOCALE: None.None

pandas: 0.23.4
pytest: 3.8.0
pip: 10.0.1
setuptools: 40.2.0
Cython: 0.28.5
numpy: 1.15.1
scipy: 1.1.0
pyarrow: None
xarray: None
IPython: 6.5.0
sphinx: 1.7.9
patsy: 0.5.0
dateutil: 2.7.3
pytz: 2018.5
blosc: None
bottleneck: 1.2.1
tables: 3.4.4
numexpr: 2.6.8
feather: None
matplotlib: 2.2.3
openpyxl: 2.5.6
xlrd: 1.1.0
xlwt: 1.3.0
xlsxwriter: 1.1.0
lxml: 4.2.5
bs4: 4.6.3
html5lib: 1.0.1
sqlalchemy: 1.2.11
pymysql: None
psycopg2: None
jinja2: 2.10
s3fs: None
fastparquet: None
pandas_gbq: None
pandas_datareader: None

In [3]:
import numpy as np
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

创建一个DataFrame

In [4]:
df = pd.DataFrame(data,index = labels)
df.head()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no

显示详细信息

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
animal      10 non-null object
age         8 non-null float64
visits      10 non-null int64
priority    10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

索引

In [6]:
df.iloc[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

指定选择数据范围

In [7]:
df[df['visits'] > 2]

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

查看缺失值

In [8]:
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

通过给定范围查找某一属性

In [9]:
df[(df['animal'] =='cat') & (df['age'] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

改变数值

In [10]:
df.loc['f','age'] = 1.5

In [11]:
df[(df['animal'] =='cat') & (df['age'] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  1.5       3       no

groupby求均值

In [12]:
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

计算相同属性值的个数

In [13]:
df['animal'].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

属性值进行映射

In [14]:
df['priority'] = df['priority'].map({'yes':True,'no':False})

In [15]:
df.head()

  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False

属性值进行替换

In [16]:
df['animal'] = df['animal'].replace('snake','tangyudi')
df.head()

     animal  age  visits  priority
a       cat  2.5       1      True
b       cat  3.0       3      True
c  tangyudi  0.5       2     False
d       dog  NaN       3      True
e       dog  5.0       2     False

数据透视表

In [17]:
df.pivot_table(index = 'animal',columns = 'visits',values='age',aggfunc = 'mean')

visits      1    2     3
animal
cat       2.5  NaN  2.25
dog       3.0  6.0   NaN
tangyudi  4.5  0.5   NaN

提取均值组成新的数据

In [18]:
df = pd.DataFrame(np.random.random(size = (5,3)))
df.head()

          0         1         2
0  0.566677  0.422444  0.750518
1  0.780600  0.260926  0.411206
2  0.643594  0.168822  0.597253
3  0.801742  0.483189  0.516856
4  0.399930  0.760910  0.800563

In [19]:
df.sub(df.mean(axis = 1),axis = 0)

          0         1         2
0 -0.013203 -0.157436  0.170638
1  0.296355 -0.223318 -0.073038
2  0.173704 -0.301067  0.127363
3  0.201146 -0.117407 -0.083740
4 -0.253871  0.107109  0.146762

统计不同属性值的个数

In [20]:
len(df) - df.duplicated(keep=False).sum()

5

In [21]:
len(df.drop_duplicates(keep=False))

5

给定数据，分别求滑动窗口的均值（加入补0操作）

In [22]:
import numpy as np
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})

In [23]:
df.head(12)

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0

In [24]:
g1 = df.groupby(['group'])['value']
g2 = df.fillna(0).groupby(['group'])['value']
s = g2.rolling(3,min_periods=1).sum()/g2.rolling(3,min_periods=1).count()
s.reset_index(level = 0,drop=True).sort_index()

0     1.000000
1     1.500000
2     3.000000
3     1.500000
4     1.666667
5     2.000000
6     1.000000
7     1.333333
8     3.666667
9     1.333333
10    3.000000
11    4.000000
Name: value, dtype: float64

指定时间序列进行计算

In [25]:
dt = pd.date_range(start = '2017-01-01',end = '2017-12-31',freq = 'D')
s = pd.Series(np.random.rand(len(dt)),index = dt)
s[:5]

2017-01-01    0.814985
2017-01-02    0.433401
2017-01-03    0.677269
2017-01-04    0.859706
2017-01-05    0.243802
Freq: D, dtype: float64

In [26]:
s[s.index.weekday == 2].sum()

25.654775666503006

重采样

In [27]:
s.resample('M').mean()

2017-01-31    0.462347
2017-02-28    0.462293
2017-03-31    0.582895
2017-04-30    0.497392
2017-05-31    0.483933
2017-06-30    0.469615
2017-07-31    0.573850
2017-08-31    0.440969
2017-09-30    0.521836
2017-10-31    0.477332
2017-11-30    0.447169
2017-12-31    0.473778
Freq: M, dtype: float64

对缺失值数据自动计算

In [28]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [29]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)

In [30]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

将from to 这列展开成两个特征

In [31]:
temp = df.From_To.str.split('_',expand = True)
temp.columns = ['From','To']

temp['From'] = temp['From'].str.capitalize()
temp['To'] = temp['To'].str.capitalize()

In [32]:
df = df.join(temp)
df.head()

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,London

In [33]:
df = df.drop('From_To',axis = 1)
df.head()

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

首字母大写，其他小写

删除from to这列，并加入temp这列

去掉airline中多余的字符

In [34]:
df['Airline'] = df['Airline'].str.extract('([a-zA-Z\s]+)',expand = False).str.strip()
df.head()

   FlightNumber  RecentDelays          Airline      From         To
0         10045      [23, 47]              KLM    London      Paris
1         10055            []       Air France    Madrid      Milan
2         10065  [24, 43, 87]  British Airways    London  Stockholm
3         10075          [13]       Air France  Budapest      Paris
4         10085      [67, 32]        Swiss Air  Brussels     London

将RecentDelays中的数据分开写

In [35]:
delays = df['RecentDelays'].apply(pd.Series)
delays.columns = ['delay_{}'.format(n) for n in range(1,len(delays.columns)+1)]
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

多重索引

In [36]:
letters = ['A','B','C']
numbers = list(range(10))
mi = pd.MultiIndex.from_product([letters,numbers])
s = pd.Series(np.random.rand(30),index=mi)
s

A  0    0.005414
   1    0.979841
   2    0.075286
   3    0.104767
   4    0.302912
   5    0.807930
   6    0.717018
   7    0.538126
   8    0.348266
   9    0.616309
B  0    0.507716
   1    0.812587
   2    0.884793
   3    0.871038
   4    0.478653
   5    0.003004
   6    0.209823
   7    0.268073
   8    0.660795
   9    0.936389
C  0    0.318115
   1    0.165369
   2    0.602173
   3    0.697820
   4    0.337572
   5    0.038512
   6    0.778971
   7    0.219596
   8    0.640223
   9    0.337395
dtype: float64

定位数据

In [37]:
s.loc[pd.IndexSlice[:'B',5:]]

A  5    0.807930
   6    0.717018
   7    0.538126
   8    0.348266
   9    0.616309
B  5    0.003004
   6    0.209823
   7    0.268073
   8    0.660795
   9    0.936389
dtype: float64

按索引计算

In [38]:
s.sum(level = 1)

0    0.831246
1    1.957797
2    1.562252
3    1.673625
4    1.119137
5    0.849447
6    1.705812
7    1.025796
8    1.649284
9    1.890093
dtype: float64

变换索引

In [39]:
new = s.swaplevel(0,1)
new

0  A    0.005414
1  A    0.979841
2  A    0.075286
3  A    0.104767
4  A    0.302912
5  A    0.807930
6  A    0.717018
7  A    0.538126
8  A    0.348266
9  A    0.616309
0  B    0.507716
1  B    0.812587
2  B    0.884793
3  B    0.871038
4  B    0.478653
5  B    0.003004
6  B    0.209823
7  B    0.268073
8  B    0.660795
9  B    0.936389
0  C    0.318115
1  C    0.165369
2  C    0.602173
3  C    0.697820
4  C    0.337572
5  C    0.038512
6  C    0.778971
7  C    0.219596
8  C    0.640223
9  C    0.337395
dtype: float64